## Python Study Notes 1

In [2]:
import pandas as pd
import numpy as np

In [3]:
a = ("John", "Charles", "Mike","Amy")
b = ("Jenny", "Christy", "Monica")

#### zip function generate pairs for tuples. 
#### use the tuple() function to display a readable version of the result:

In [4]:
x = zip(a, b)
tuple(x)

(('John', 'Jenny'), ('Charles', 'Christy'), ('Mike', 'Monica'))

In [45]:
list(zip(a,b))

[('John', 'Jenny'), ('Charles', 'Christy'), ('Mike', 'Monica')]

####  Create mapping df using zip

In [5]:
mapping = pd.DataFrame(list(zip(a, b)), columns = ['Boy', 'Girl'])

In [6]:
mapping

       Boy     Girl
0     John    Jenny
1  Charles  Christy
2     Mike   Monica

#### df.loc using column name to return values

In [7]:
mapping.loc[1,'Boy']

'Charles'

#### df.iloc using position to return values

In [8]:
mapping.iloc[1,0]

'Charles'

#### df.colname.unique returns the unique value of colname

In [9]:
name_list = mapping.Boy.unique()
name_list

array(['John', 'Charles', 'Mike'], dtype=object)

#### Using for loop in one line

In [10]:
[x[:2] for x in list(name_list)]

['Jo', 'Ch', 'Mi']

In [11]:
[x[:2] for x in list(mapping.Boy)]

['Jo', 'Ch', 'Mi']

#### Delete observation with certain values

In [12]:
exclusion = ['John', 'Mike']
exclusion2 = ['Jenny','Hanna']
new_mapping = mapping[~np.isin(mapping.Boy, exclusion)]
new_mapping

       Boy     Girl
1  Charles  Christy

#### another way:

In [13]:
new_mapping = mapping[mapping.Boy.isin(exclusion) == False]
new_mapping

       Boy     Girl
1  Charles  Christy

#### another way with multiply exclusion:

In [14]:
exclusion_df = pd.DataFrame(np.array([exclusion,exclusion2]),columns=['a','b'])
exclusion_df

       a      b
0   John   Mike
1  Jenny  Hanna

In [15]:
mapping.loc[(~(mapping.Boy.isin(exclusion_df.a)) & ~(mapping.Girl.isin(exclusion_df.b))),:]

       Boy     Girl
1  Charles  Christy
2     Mike   Monica

#### Get observation with certain values

In [18]:
in_exclusion = mapping.loc[((mapping.Boy.isin(exclusion_df.a)) | (mapping.Girl.isin(exclusion_df.b))), :]
in_exclusion

Empty DataFrame
Columns: [Boy, Girl]
Index: []

#### Append array

In [67]:
np.append(mapping.Boy, ['Henry','Jeffery'])

array(['John', 'Charles', 'Mike', 'Henry', 'Jeffery'], dtype=object)

#### Adding new Column

In [72]:
mapping['Class'] = [1,2,3]
mapping

       Boy     Girl  Class
0     John    Jenny      1
1  Charles  Christy      2
2     Mike   Monica      3

#### Changing type between float and int

In [74]:
mapping.Class = mapping.Class.astype(float)
mapping

       Boy     Girl  Class
0     John    Jenny    1.0
1  Charles  Christy    2.0
2     Mike   Monica    3.0

In [75]:
mapping.Class = mapping.Class.astype(int)
mapping

       Boy     Girl  Class
0     John    Jenny      1
1  Charles  Christy      2
2     Mike   Monica      3

#### Rename Column

In [81]:
mapping.rename(columns = {'Boy': 'Boy Name'}, inplace=True)
mapping

  Boy Name     Girl  Class
0     John    Jenny      1
1  Charles  Christy      2
2     Mike   Monica      3

#### Replace values in certain column

In [85]:
mapping['Boy Name'].replace('John', 'Jeffery', regex =True, inplace = True)
mapping

  Boy Name     Girl  Class
0  Jeffery    Jenny      1
1  Charles  Christy      2
2     Mike   Monica      3